
Процедура ПередЗаписью ( Отказ )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	Если ( ЭтоНовый () И НомерПоПорядку = 0) Тогда
		установитьНомерПоПорядку ();
		УстановитьНовыйКод ();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи ( Отказ )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура установитьНомерПоПорядку ()
	
	с = "
	|выбрать первые 1
	|	НомерПоПорядку как НомерПоПорядку
	|из
	|	Справочник.Контрагенты
	|где
	|	НомерПоПорядку <> 0
	|упорядочить по
	|	НомерПоПорядку убыв
	|";
	запрос = Новый Запрос ( с );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Если ( выборка.Следующий () ) Тогда
		НомерПоПорядку = выборка.НомерПоПорядку + 1;
	Иначе
		НомерПоПорядку = 1;	
	КонецЕсли;
			
КонецПроцедуры

Процедура ПриУстановкеНовогоКода ( СтандартнаяОбработка, Префикс )
	
	СтандартнаяОбработка = Ложь;
	Если ( НомерПоПорядку = 0) Тогда
		ВызватьИсключение "Не назначен ""Номер по порядку""!"
	КонецЕсли;
	Код = Справочники.Контрагенты.ПолучитьКод ( НомерПоПорядку );
	
КонецПроцедуры
