
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	Иначе
		Если ( Объект.Роли.Количество () = 0 ) Тогда
			заполнитьТЧРоли ();			
		КонецЕсли;
	КонецЕсли;
	ОтобразитьПароль = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	ОтобразитьПароль = НЕ ОтобразитьПароль;
	Элементы.Пароль.РежимПароля = ОтобразитьПароль;
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	заполнитьТЧРоли ();
			
КонецПроцедуры

&НаСервере
Процедура заполнитьТЧРоли ()
	
	Для Каждого роль Из Метаданные.Роли Цикл
		новая = Объект.Роли.Добавить ();
		новая.Роль = роль;
		новая.Использование = Ложь;		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления ( Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр )
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПередУдалением ( Элемент, Отказ )
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью ( Отказ, ПараметрыЗаписи )
	
	// код ...	
	
КонецПроцедуры
