
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	Иначе
		Если ( Объект.Роли.Количество () = 0 ) Тогда
			заполнитьТЧРоли ();
		Иначе
			заполнитьСинонимыРолей ();
		КонецЕсли;
	КонецЕсли;
	ОтобразитьПароль = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если ( Объект.Наименование <> "" ) Тогда
		Если ( Объект.НаименованиеПолное = "" ) Тогда
			Объект.НаименованиеПолное = Объект.Наименование;			
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль ( Команда )
	
	ОтобразитьПароль = НЕ ОтобразитьПароль;
	Элементы.Пароль.РежимПароля = ОтобразитьПароль;
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	заполнитьТЧРоли ();
			
КонецПроцедуры

&НаСервере
Процедура заполнитьТЧРоли ()
	
	Для Каждого роль Из Метаданные.Роли Цикл
		новая = Объект.Роли.Добавить ();
		новая.Роль = роль.Имя;
		новая.РольСиноним = роль.Синоним;
		новая.Использование = Ложь;		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Процедура заполнитьСинонимыРолей ()
	
	Для Каждого строкаТЧ Из Объект.Роли Цикл
		роль = Метаданные.Роли.Найти ( строкаТЧ.Роль );
		Если ( роль <> Неопределено ) Тогда
			строкаТЧ.РольСиноним = роль.Синоним;			
		КонецЕсли;	
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления ( Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр )
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПередУдалением ( Элемент, Отказ )
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью ( Отказ, ПараметрыЗаписи )
	
	// код ...	
	
КонецПроцедуры