
Функция ПолныеПрава () Экспорт
	
	Возврат РольДоступна ( "ПолныеПрава" );

КонецФункции

Функция ПолучитьЗаголовок () Экспорт

	Если ( ПараметрыСеанса.КонтрагентИспользование ) Тогда
		с = "Вложения (контрагент-""" + ПараметрыСеанса.Контрагент + """)";
	Иначе
		с = "Вложения (не установлен контрагент)";	
	КонецЕсли;
	Возврат с;

КонецФункции

Функция ПолучитьАдресПодключенияКонтрагента ( Контрагенты ) Экспорт
	
	Если ( ТипЗнч ( Контрагенты ) = Тип ( "СправочникСсылка.Контрагенты") ) Тогда
		м = Новый Массив ();
		м.Добавить ( Контрагенты );
	Иначе
		м = Контрагенты;
	КонецЕсли;
	с = "
	|выбрать
	|	Спр.Ссылка как Контрагент,
	|	Спр.Код как Код,
	|	Адрес.Значение как Адрес
	|из
	|	Справочник.Контрагенты как Спр,
	|	Константа.АдресПубликацииИБ как Адрес
	|где
	|	Спр.Ссылка в ( &Контрагенты )
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Контрагенты", Контрагенты );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	карта = Новый Соответствие ();
	Пока выборка.Следующий () Цикл
		с = выборка.Адрес + "/?Z=" + выборка.Код; 
		карта.Вставить ( выборка.Контрагент, с );	
	КонецЦикла;
	Если ( м.Количество () = 1 ) Тогда
		Возврат карта [ м [ 0 ] ];
	Иначе
		Возврат карта;
	КонецЕсли;

КонецФункции