

Функция ПолучитьКлючиСтрокСОтбором ( Количество, Отбор ) Экспорт 
	
	УстановитьПривилегированныйРежим ( Истина );
	Если ( Отбор.Количество () = 0 ) Тогда
		максимум = 1;
	Иначе
		с = "
		|выбрать
		|	максимум ( Код ) как Код
		|из
		|	Справочник.будКлючиСтрок
		|где
		|	Ссылка в ( &Отбор )  
		|";
		запрос = Новый Запрос ( с );
		запрос.УстановитьПараметр ( "Отбор", Отбор );
		результат = запрос.Выполнить ();
		выборка = результат.Выбрать ();
		выборка.Следующий ();
		максимум = выборка.Код + 1;
	КонецЕсли; 
	м = Новый Массив ();
	данные = получитьКлючиСтрок ();
	Для счетчик = 1 По Количество Цикл
		ключСтроки = данные [ максимум ];
		Если ( ключСтроки = Неопределено ) Тогда
			ключСтрокиОбъект = Справочники.КлючиСтрок.СоздатьЭлемент ();
			ключСтрокиОбъект.Код = максимум;
			Попытка
				ключСтрокиОбъект.Записать ();
			Исключение
				Сообщить ( "Не удалось создать ключ строки. Обратитесь к администратору!", СтатусСообщения.Важное );   
				УстановитьПривилегированныйРежим ( Ложь );
				Возврат Ложь;
			КонецПопытки;
			ключСтроки = ключСтрокиОбъект.Ссылка;
		КонецЕсли;
		м.Добавить ( ключСтроки );
		максимум = максимум + 1;		
	КонецЦикла; 
	УстановитьПривилегированныйРежим ( Ложь );
	Возврат м;

КонецФункции

Функция ПолучитьКлючСтроки ( Количество = 0 ) Экспорт 
	
	запрос = Новый Запрос ();
	с = "
	|выбрать
	|	Ссылка как Ссылка,
	|	Код как Код
	|из
	|	Справочник.КлючиСтрок
	|";
	Если ( Количество <> 0 ) Тогда
		с = с + " где Код <= &Количество ";
		запрос.УстановитьПараметр ( "Количество", Количество );
	КонецЕсли;
	с = с + " 
	|упорядочить по
	|	Код возр 
	|";
	запрос.Текст = с;
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	с = Новый Соответствие ();
	Пока ( выборка.Следующий () ) Цикл
		с.Вставить ( выборка.Код, выборка.Ссылка );	
	КонецЦикла; 
	Возврат с;

КонецФункции

Функция СоздатьКлючСтроки ( Код ) Экспорт 
	
	УстановитьПривилегированныйРежим ( Истина );
	ключ = Справочники.КлючиСтрок.СоздатьЭлемент ();
	ключ.Код = Код;
	Попытка
		ключ.Записать ();
	Исключение
		Сообщить ( "Не удалось создать ключ строки. Обратитесь к администратору!", СтатусСообщения.Важное );   
		ключ = Справочники.КлючиСтрок.ПустаяСсылка ();
	КонецПопытки;
	УстановитьПривилегированныйРежим ( Ложь );
	Возврат ключ;

КонецФункции 