&НаКлиенте 
Процедура Подготовить ( ПроцедураВозврата ) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами ( Новый ОписаниеОповещения ( "ПодключитьРасширение", ЭтотОбъект, ПроцедураВозврата ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьРасширение ( Подключено, ПроцедураВозврата ) Экспорт
	
	Если ( Подключено ) Тогда
		ВыполнитьОбработкуОповещения ( ПроцедураВозврата );
	Иначе
		НачатьУстановкуРасширенияРаботыСФайлами ( Новый ОписаниеОповещения ( "УстановитьРасширение", ЭтотОбъект, ПроцедураВозврата ) );
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширение ( ПроцедураВозврата ) Экспорт
	
	Подготовить ( ПроцедураВозврата );
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФайл ( ИмяФайла ) Экспорт 
	
	Если ( ИмяФайла = Неопределено ИЛИ ПустаяСтрока ( ИмяФайла ) ) Тогда
		Возврат;
	КонецЕсли;
	ф = Новый Файл ( ИмяФайла );
	Если ( ф.Существует () ) Тогда
		УдалитьФайлы ( ИмяФайла );
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьФильтрРасширений () Экспорт

	Возврат ( НСтр ( "ru = 'Файлы (*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.pdf;*.xml;*.txt)|*.gif;*.jpg;*.jpeg;*.png;*.tiff;*.pdf;*.xml;*.txt'" ) );
				
КонецФункции