
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение  ();		
	КонецЕсли;
	установитьЗаголовок  ();
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.Контрагент = ПараметрыСеанса.Контрагент;
	
КонецПроцедуры

&НаСервере
Процедура установитьЗаголовок ()
	
	с = Документы.Вложение.ПолучитьПредставлениеПоВиду ( Объект.ВидВложения );
	Если ( Объект.Ссылка.Пустая () ) Тогда
		Заголовок = с + " (создание)";
	Иначе
		Заголовок = с + " от " + Формат ( Объект.Дата, "ДФ=dd.MM.yyyy" ) + " номер " + Объект.Номер;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	// код ...
	
КонецПроцедуры