
Перем ЗадаватьВопросПриЗакрытии Экспорт;

Процедура ПередНачаломРаботыСистемы ( Отказ )
	
	передНачаломРаботыПользователя ();
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы ()
	
	ЗадаватьВопросПриЗакрытии = Истина;
	установитьЗаголовок ();
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы ( Отказ, ТекстПредупреждения )
	
	#Если ВебКлиент Тогда 
		ТекстПредупреждения = "Завершить работу с программой?"; 
	#Иначе
		Если ( ЗадаватьВопросПриЗакрытии ) Тогда
			Отказ = Истина;
			ТекстПредупреждения = "Завершить работу с программой?"; 
		КонецЕсли; 
	#КонецЕсли	
	
КонецПроцедуры

Процедура передНачаломРаботыПользователя ()
	
	режим = РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто;
	Если ( Серверный.ПолныеПрава () ) Тогда
		режим = РежимОсновногоОкнаКлиентскогоПриложения.Обычный;
	КонецЕсли;
	КлиентскоеПриложение.УстановитьРежимОсновногоОкна ( режим );
			
КонецПроцедуры

Процедура установитьЗаголовок ()
	
	с = Серверный.ПолучитьЗаголовок ();
	УстановитьЗаголовокПриложения ( с );
			
КонецПроцедуры