
Процедура УстановкаПараметровСеанса ( ТребуемыеПараметры )
	
	Если ( ТребуемыеПараметры = Неопределено ) Тогда
		Возврат;		
	КонецЕсли;
	Для Каждого параметр Из ТребуемыеПараметры Цикл
		Если ( параметр = "ТекущийПользователь" ) Тогда
			установитьТекущегоПользователя ();	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура установитьТекущегоПользователя ()
	
	имя = ИмяПользователя ();
	текущийПользователь = Справочники.Пользователи.НайтиПоНаименованию ( имя, Истина );
	Если ( текущийПользователь.Пустая () ) Тогда
		Если ( Общий.ПолныеПрава () ) Тогда
			текущийПользователь = создатьПользователя  ( имя );
		КонецЕсли;
		ВызватьИсключение "Не найден пользователь с таким именем!";
	КонецЕсли;
	ПараметрыСеанса.ТекущийПользователь = текущийПользователь;
			
КонецПроцедуры

Функция создатьПользователя ( Имя )
	
	пользователь = Справочники.Пользователи.СоздатьЭлемент ();
	пользователь.Наименование = Имя;
	пользователь.Записать ();
	Возврат пользователь.Ссылка;

КонецФункции