
Процедура ЗаписатьФайл ( Параметры ) Экспорт
	
	набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей ();
	набор.Отбор.Объект.Установить ( Параметры.Объект );
	набор.Отбор.КлючСтроки.Установить ( Параметры.КлючСтроки );
	набор.Прочитать ();
	набор.Очистить();
	запись = набор.Добавить ();
	ЗаполнитьЗначенияСвойств ( запись, Параметры );
	запись.Папка = Строка ( запись.Объект.УникальныйИдентификатор () );
	набор.Записать ();
	записатьФайлНаДиск  ( запись );
			
КонецПроцедуры

Процедура записатьФайлНаДиск ( Запись )
	
	адрес = Параметры.Адрес;
	данные = ПолучитьИзВременногоХранилища ( адрес );
	путь = создатьПапкуОбъекта ( Параметры );
	ИмяФайла = Параметры.Имя;
 	данные.Записать ( ХранениеФайлов + ИмяФайла );
	Если ( ЭтоАдресВременногоХранилища ( адрес ) ) Тогда
		УдалитьИзВременногоХранилища ( адрес ); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура создатьПапкуОбъекта ()
	
	путьКаталога = Лев ( ХранениеФайлов, СтрДлина ( ХранениеФайлов ) - 1 );
	каталог = Новый Файл ( путьКаталога );
	Если ( каталог.Существует () ) Тогда
		// код ...  
	Иначе
		СоздатьКаталог ( каталог.ПолноеИмя );
	КонецЕсли;
	
КонецПроцедуры