
Процедура ЗаписатьФайл ( Параметры ) Экспорт
	
	набор = РегистрыСведений.Файлы.СоздатьНаборЗаписей ();
	набор.Отбор.Объект.Установить ( Параметры.Объект );
	набор.Отбор.КлючСтроки.Установить ( Параметры.КлючСтроки );
	набор.Прочитать ();
	набор.Очистить();
	запись = набор.Добавить ();
	ЗаполнитьЗначенияСвойств ( запись, Параметры );
	запись.Папка = получитьИмяПапки ( Параметры );
	набор.Записать ();
	записатьФайлНаДиск  ( Параметры.Адрес, запись );
	
КонецПроцедуры

Функция получитьИмяПапки ( Параметры )
	
	с = "
	|выбрать
	|	представление ( Док.Ссылка ) как Объект,
	|	представление ( Ключи.Ссылка ) как КлючСтроки
	|из
	|	Документ.Вложение как Док,
	|	Справочник.КлючиСтрок как Ключи
	|где
	|	Док.Ссылка = &Объект
	|	и Ключи.Ссылка = &КлючСтроки
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Объект", Параметры.Объект );
	запрос.УстановитьПараметр ( "КлючСтроки", Параметры.КлючСтроки );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	Возврат ( выборка.Объект + " ключ " + выборка.КлючСтроки );

КонецФункции

Процедура записатьФайлНаДиск ( Адрес, Запись )
	
	данные = ПолучитьИзВременногоХранилища ( Адрес );
	путь = Константы.ХранениеФайлов.Получить () + Запись.Папка;
	СоздатьКаталог ( путь );
 	данные.Записать ( путь + Запись.ИмяФайла );
	Если ( ЭтоАдресВременногоХранилища ( Адрес ) ) Тогда
		УдалитьИзВременногоХранилища ( Адрес ); 
	КонецЕсли;
	
КонецПроцедуры