
Процедура ПередЗаписью ( Отказ, Замещение )
	
	Если ( Отбор.Количество () = 0 ) Тогда
		Отказ = ИСТИНА;
	Иначе
		Для Каждого элемент Из Отбор Цикл
			Если ( элемент.Имя = "Объект" ) Тогда
				Если ( элемент.Значение = Неопределено ИЛИ НЕ ЗначениеЗаполнено ( элемент.Значение ) ) Тогда
					текст = "Пользователь: " + ПараметрыСеанса.ТекущийПользователь + ", попытка записи в регистр записей без отбора по объекту";
					Отказ = ИСТИНА;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры