
Процедура ОбработкаПолученияПолейПредставления ( Поля, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить ( "ВидВложения" );
	Поля.Добавить ( "Номер" );
	Поля.Добавить ( "Дата" );
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления ( Данные, Представление, СтандартнаяОбработка )
	
	СтандартнаяОбработка = Ложь;
	с = ПолучитьПредставлениеПоВиду ( Данные.ВидВложения );
	Представление = с + + " # " + Данные.Номер + " от " + Формат ( Данные.Дата, "ДФ=dd.MM.yyyy" );
	
КонецПроцедуры

Функция ПолучитьПредставлениеПоВиду ( ВидВложения ) Экспорт
	
	с = "";
	Если ( ВидВложения = Перечисления.ВидВложения.НакладнаяСчет ) Тогда
		с = "Накладная (счет)";
	ИначеЕсли ( ВидВложения = Перечисления.ВидВложения.СертификатПротокол ) Тогда
		с = "Сертификат (протокол)";
	ИначеЕсли ( ВидВложения = Перечисления.ВидВложения.Прайс ) Тогда
		с = "Прайс";		
	КонецЕсли;
	Возврат с;

КонецФункции

