
&НаКлиенте
Процедура ОбработкаКоманды ( ПараметрКоманды, ПараметрыВыполненияКоманды )
	
	отбор = Новый Структура();
	отбор.Вставить ( "ВидВложения", ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );
	п = Новый Структура ();
	п.Вставить ( "Отбор", отбор );
	п.Вставить ( "Заголовок", "Накладные (счета)" );
	ОткрытьФорму ( "Документ.Вложение.Форма.Список", п, ПараметрыВыполненияКоманды.Источник, "НакладнаяСчет", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка );

КонецПроцедуры