
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );	
	
КонецПроцедуры

&НаСервере
Процедура установитьПараметрыСписка ( Значение )
	
	настройки = Новый НастройкиКомпоновкиДанных ();
	отбор = настройки.Отбор.Элементы.Добавить ( Тип ( "ЭлементОтбораКомпоновкиДанных" ) ); 
	отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ( "ВидВложения" );
	отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	отбор.Использование = Истина;
	отбор.ПравоеЗначение = Значение;
	Список.КомпоновщикНастроек.ЗагрузитьНастройки ( настройки );
	Элементы.Список.Обновить ();
			
КонецПроцедуры



&НаКлиенте
Процедура ДекорацияНакладнаяНажатие ( Элемент )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСертификатНажатие ( Элемент )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.СертификатПротокол" ) );

КонецПроцедуры

&НаКлиенте
Процедура НадписьНакладнаяНажатие ( Элемент )
	
	открытьНакладные ();

КонецПроцедуры

&НаКлиенте
Процедура НадписьСертификатНажатие ( Элемент )
	
	открытьСертификаты ();

КонецПроцедуры

&НаКлиенте
Процедура НадписьПрайсНажатие ( Элемент )
	
	открытьПрайсы ();

КонецПроцедуры

&НаКлиенте
Процедура открытьНакладные ( )
		
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );
			
КонецПроцедуры

&НаКлиенте
Процедура открытьСертификаты ( )
		
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.СертификатПротокол" ) );
			
КонецПроцедуры

&НаКлиенте
Процедура открытьПрайсы ( )
		
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.Прайс" ) );
			
КонецПроцедуры



&НаКлиенте
Процедура ДекорацияПрайсНажатие ( Элемент )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.Прайс" ) );
	
КонецПроцедуры