
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );	
	
КонецПроцедуры

&НаСервере
Процедура установитьПараметрыСписка ( Значение )
	
	настройки = Новый НастройкиКомпоновкиДанных ();
	отбор = настройки.Отбор.Элементы.Добавить ( Тип ( "ЭлементОтбораКомпоновкиДанных" ) ); 
	отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных ( "ВидВложения" );
	отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	отбор.Использование = Истина;
	отбор.ПравоеЗначение = Значение;
	Список.КомпоновщикНастроек.ЗагрузитьНастройки ( настройки );
	Элементы.Список.Обновить ();
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНакладныеСчета ( Команда )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.НакладнаяСчет" ) );

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрайсы ( Команда )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.Прайс" ) );
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификатыПротоколы ( Команда )
	
	установитьПараметрыСписка ( ПредопределенноеЗначение ( "Перечисление.ВидВложения.СертификатПротокол" ) );
	
КонецПроцедуры